# add repositories
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# packages
cask "xquartz"
brew "ascii"
brew "awscli"
brew "cabal-install"
brew "cairo"
brew "ctags"
brew "docker-clean"
brew "epubcheck"
brew "ffmpeg"
brew "fontconfig"
brew "freetype"
brew "gd"
brew "gdbm"
brew "gdk-pixbuf"
brew "gettext"
brew "gh"
brew "git"
brew "glib"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "graphviz"
brew "harfbuzz"
brew "hub"
brew "icu4c"
brew "imagemagick"
brew "jpeg"
brew "jq"
brew "libassuan"
brew "libcroco"
brew "libgcrypt"
brew "libgpg-error"
brew "libksba"
brew "librsvg"
brew "libtool"
brew "libusb"
brew "libusb-compat"
brew "lua"
brew "mas"
brew "oniguruma"
brew "openssl"
brew "pandoc"
brew "pinentry"
brew "pixman"
brew "pkg-config"
brew "pth"
brew "shared-mime-info"
brew "ssh-copy-id"
brew "vim"

# cask packages
cask "alfred"
cask "appcleaner"
cask "charles"
cask "chatwork"
cask "chrome-remote-desktop-host"
cask "clamxav"
cask "dash"
cask "discord"
cask "docker"
cask "dropbox"
cask "firefox"
cask "flash-player"
cask "gitter"
cask "google-backup-and-sync"
cask "google-chrome"
cask "google-japanese-ime"
cask "iterm2"
cask "java"
cask "karabiner-elements"
cask "keepassx"
cask "mactex"
cask "microsoft-teams"
cask "postman"
#cask "rancher"
cask "skitch"
cask "skype"
cask "slack"
cask "soundflower"
cask "stoplight-studio"
cask "the-unarchiver"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"

# packages on AppStore
mas "Tweetbot", id: 557168941
